<?php
	/**
	*  +----------------------------------------------------------------------------------------------+
	*   | Explain:  登入后台
	*  +----------------------------------------------------------------------------------------------+
	*   | Author: ONLY <1123265518@qq.com>
	*  +----------------------------------------------------------------------------------------------+
	*   | Creater Time : 2014-8-1 	
	*  +----------------------------------------------------------------------------------------------+
	*   | Link :	http://www.phpyrb.com	     
	*  +----------------------------------------------------------------------------------------------+
	**/
	
	namespace Admin\Controller;
	use Think\Controller;

	class LoginController extends Controller{
		
		function _init(){
			
		}
		
		function index(){
			$this->display();
		}
		
		function Login(){
			$name = t($_REQUEST['admin_name']);
			$passwd = t($_REQUEST['admin_paddwd']);
			$m = M('AdminUser','');
			$reid = $m->where(array(''));
		}
	}