<?php
	/**
	*  +----------------------------------------------------------------------------------------------+
	*   | Explain:  项目入口文件
	*  +----------------------------------------------------------------------------------------------+
	*   | Author: ONLY <1123265518@qq.com>
	*  +----------------------------------------------------------------------------------------------+
	*   | Creater Time : 2014-8-24 	
	*  +----------------------------------------------------------------------------------------------+
	*   | Link :  http://www.phpyrb.com	     
	*  +----------------------------------------------------------------------------------------------+
	**/

	// 应用入口文件

	// 检测PHP环境
	if(version_compare(PHP_VERSION,'5.3.0','<'))  die('require PHP > 5.3.0 !');
	
	// 开启调试模式 建议开发阶段开启 部署阶段注释或者设为false
	define('APP_DEBUG',True);
	
	// 定义应用目录
	define('APP_PATH','./MaWei/');
	
	//应用运行时目录
	define('RUNTIME_PATH', './Cache/');
	
	//根路径
	define('ROOT_PATH', str_replace('\\','/',dirname(__FILE__)));
	
	// 引入ThinkPHP入口文件
	require './ThinkPHP/ThinkPHP.php';